ЛИС2/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <comment>В справочнике хранится информация о сотрудниках организации.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействуетПоДоверенности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитыДоверенности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЭкологию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаОбращениеСОтходами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>38</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеДляПривлеченияТруда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидТрудоустройства</name>
    <type>
      <types>EnumRef.ВидыТрудоустройства</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛетОпыта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Инструктажи</name>
    <attributes>
      <name>ДатаИнструктажа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удалить_ПротоколыПроверки</name>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Удалить_Обучение</name>
    <attributes>
      <name>ВидОбучения</name>
      <type>
        <types>EnumRef.Удалить_ВидыОбученияСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерИНаименованиеДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециализацияОбученияСписокОтходов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрагентПроводившийОбучение</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыполняемыеФункции</name>
    <attributes>
      <name>ВыполняемаяФункция</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Образование</name>
    <attributes>
      <name>НаименованиеУчебногоЗаведения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КвалификацияПоДокументу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РеквизитыДокументаОбОбразовании</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрактическийОпыт</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДеятельности</name>
      <type>
        <types>CatalogRef.ВидыДеятельностиИЛ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Enums/ВидыТрудоустройства/ВидыТрудоустройства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТрудоустройства</name>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Catalogs/Сотрудники/ManagerModule.bsl
Функция СформироватьТабДокСведенийОСотрудниках(МассивОбъектов, ОбъектыПечати)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = Справочники.Сотрудники.ПолучитьМакет("СведенияОРаботникахЛаборатории");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Фамилия + "" "" + Сотрудники.Имя + "" "" + Сотрудники.Отчество КАК ФИО,
	|	Сотрудники.СНИЛС,
	|	Сотрудники.ДатаРождения,
	|	Сотрудники.МестоРождения,
	|	Сотрудники.ОснованиеДляПривлеченияТруда,
	|	ВЫБОР
	|		КОГДА Сотрудники.ВидТрудоустройства = ЗНАЧЕНИЕ(Перечисление.ВидыТрудоустройства.ОсновноеМестоРаботы)
	|			ТОГДА ""по основному месту работы""
	|		КОГДА Сотрудники.ВидТрудоустройства = ЗНАЧЕНИЕ(Перечисление.ВидыТрудоустройства.Совместительство)
	|			ТОГДА ""по совместительству""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ВидТрудоустройства,
	|	Сотрудники.Должность,
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.Примечание,
	|	Сотрудники.КоличествоЛетОпыта
	|ПОМЕСТИТЬ ВТ_ОбщиеСведения
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&МассивОбъектов)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиВыполняемыеФункции.ВыполняемаяФункция,
	|	ВТ_ОбщиеСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ОбщиеСведения КАК ВТ_ОбщиеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники.ВыполняемыеФункции КАК СотрудникиВыполняемыеФункции
	|		ПО ВТ_ОбщиеСведения.Ссылка = СотрудникиВыполняемыеФункции.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ОбщиеСведения.ФИО
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиОбразование.НаименованиеУчебногоЗаведения,
	|	СотрудникиОбразование.ДатаОкончания,
	|	СотрудникиОбразование.КвалификацияПоДокументу,
	|	СотрудникиОбразование.РеквизитыДокументаОбОбразовании,
	|	ВТ_ОбщиеСведения.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ОбщиеСведения КАК ВТ_ОбщиеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники.Образование КАК СотрудникиОбразование
	|		ПО ВТ_ОбщиеСведения.Ссылка = СотрудникиОбразование.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ОбщиеСведения.ФИО
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиПрактическийОпыт.ДатаНачала,
	|	СотрудникиПрактическийОпыт.ДатаОкончания,
	|	СотрудникиПрактическийОпыт.Организация,
	|	ВТ_ОбщиеСведения.Ссылка КАК Ссылка,
	|	СотрудникиПрактическийОпыт.ВидДеятельности.Представление КАК ВидДеятельности
	|ИЗ
	|	ВТ_ОбщиеСведения КАК ВТ_ОбщиеСведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники.ПрактическийОпыт КАК СотрудникиПрактическийОпыт
	|		ПО ВТ_ОбщиеСведения.Ссылка = СотрудникиПрактическийОпыт.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ОбщиеСведения.ФИО
	|ИТОГИ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОбщиеСведения.ФИО КАК ФИО,
	|	ВТ_ОбщиеСведения.СНИЛС,
	|	ВТ_ОбщиеСведения.ДатаРождения,
	|	ВТ_ОбщиеСведения.МестоРождения,
	|	ВТ_ОбщиеСведения.ОснованиеДляПривлеченияТруда,
	|	ВТ_ОбщиеСведения.ВидТрудоустройства,
	|	ВТ_ОбщиеСведения.Должность,
	|	ВТ_ОбщиеСведения.Ссылка,
	|	ВТ_ОбщиеСведения.Примечание,
	|	ВТ_ОбщиеСведения.КоличествоЛетОпыта
	|ИЗ
	|	ВТ_ОбщиеСведения КАК ВТ_ОбщиеСведения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФИО";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаОбщая = МассивРезультатов[4].Выбрать();
	ВыборкаФункции = МассивРезультатов[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОбразование = МассивРезультатов[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаОпыт = МассивРезультатов[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	
	Номер = 0;
	Пока ВыборкаОбщая.Следующий() Цикл
		
		Номер = Номер + 1;
		ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
		ОбластьСтрока.Параметры.Заполнить(ВыборкаОбщая);
		ОбластьСтрока.Параметры.Номер = Номер;
		ОбластьСтрока.Параметры.ДатаРождения = Формат(ВыборкаОбщая.ДатаРождения, "ДФ=dd.MM.yyyy");
		
		Если ВыборкаФункции.Следующий() Тогда
			ВыборкаДетальныеЗаписи = ВыборкаФункции.Выбрать();
			Если ВыборкаДетальныеЗаписи.Количество() Тогда
				СтрокаФункций = "";
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					СтрокаФункций = СтрокаФункций + Символы.ПС + "-" + ВыборкаДетальныеЗаписи.ВыполняемаяФункция + ";";
					
				КонецЦикла;
				ОбластьСтрока.Параметры.Функции = СтрокаФункций;
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаОбразование.Следующий() Тогда
			ВыборкаДетальныеЗаписи = ВыборкаОбразование.Выбрать();
			Если ВыборкаДетальныеЗаписи.Количество() Тогда
				СтрокаОбразования = "";
				Индекс = 0;
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Индекс = Индекс + 1;
					СтрокаОбразования = СтрокаОбразования + ВыборкаДетальныеЗаписи.НаименованиеУчебногоЗаведения + 
										", " + Формат(ВыборкаДетальныеЗаписи.ДатаОкончания, "ДФ=гггг") + ", " + 
										"«" + ВыборкаДетальныеЗаписи.КвалификацияПоДокументу + "»" + ", " +
										ВыборкаДетальныеЗаписи.РеквизитыДокументаОбОбразовании;
										
					Если Индекс <> ВыборкаДетальныеЗаписи.Количество() Тогда
						СтрокаОбразования = СтрокаОбразования + Символы.ПС + Символы.ПС;
					КонецЕсли;			
				КонецЦикла;
				ОбластьСтрока.Параметры.Образование = СтрокаОбразования;
			КонецЕсли;
		КонецЕсли;
		
		Если ВыборкаОпыт.Следующий() Тогда
			ВыборкаДетальныеЗаписи = ВыборкаОпыт.Выбрать();
			Если ВыборкаДетальныеЗаписи.Количество() Тогда
				СтрокаОпыта = "";
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					СтрокаОпыта = СтрокаОпыта + Символы.ПС + ВыборкаДетальныеЗаписи.Организация + ":" + Символы.ПС + Формат(ВыборкаДетальныеЗаписи.ДатаНачала, "ДФ=dd.MM.yyyy");
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДатаОкончания) Тогда
						СтрокаОпыта = СтрокаОпыта + " – " + Формат(ВыборкаДетальныеЗаписи.ДатаОкончания, "ДФ=dd.MM.yyyy");
					Иначе
						СтрокаОпыта = СтрокаОпыта + " – по настоящее время";
					КонецЕсли;
					СтрокаОпыта = СтрокаОпыта + ", " + ВыборкаДетальныеЗаписи.ВидДеятельности;								
				КонецЦикла;
				ОбластьСтрока.Параметры.ПрактическийОпыт = СтрокаОпыта;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТабДок.ПроверитьВывод(ОбластьСтрока) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьСтрока);
		
	КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СведенияОРаботникахЛаборатории", "Сведения о работниках лаборатории",
				СформироватьТабДокСведенийОСотрудниках(МассивОбъектов, ОбъектыПечати), , "Справочник.Сотрудники.СведенияОРаботникахЛаборатории");
	
	
КонецПроцедуры
